<a href="https://colab.research.google.com/github/MrDataAnalyst/Pandas-Data-Science-Tasks/blob/master/Data_joining_and_manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [39]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [40]:
population = pd.read_excel('P11-Country-Population.xls')
life_exp = pd.read_excel('P11-Life-Expectancy-At-Birth.xls')

In [41]:
# w funkcji definiujemy zmienne które NIE zostaną zagregowane - będą zduplikowane w każdym wierszu. 
aggsMelt = population.melt(id_vars=['Country Name', 'Country Code', 'Indicator Name','Indicator Code'])
aggsMelt.head()

  Country Name Country Code  ... variable      value
0        Aruba          ABW  ...     1960    54208.0
1      Andorra          AND  ...     1960    13414.0
2  Afghanistan          AFG  ...     1960  8994793.0
3       Angola          AGO  ...     1960  5270844.0
4      Albania          ALB  ...     1960  1608800.0

[5 rows x 6 columns]

In [42]:
population.head(3)

  Country Name Country Code  ...        2012        2013
0        Aruba          ABW  ...    102393.0    102921.0
1      Andorra          AND  ...     79316.0     75902.0
2  Afghanistan          AFG  ...  29726803.0  30682500.0

[3 rows x 58 columns]

In [43]:
aggsMelt.head(3)
aggsMelt.rename(columns = {'variable':'Year'},inplace=True)
aggsMelt.rename(columns = {'value':'Population'},inplace=True)

In [44]:
life = life_exp.melt(id_vars=['Country Name','Country Code','Indicator Name','Indicator Code'])
life.head(3)

  Country Name Country Code  ... variable      value
0        Aruba          ABW  ...     1960  65.569366
1      Andorra          AND  ...     1960        NaN
2  Afghanistan          AFG  ...     1960  31.580049

[3 rows x 6 columns]

In [45]:
life = life.rename(columns = {'variable':'Year','value':'Life_exp'})

In [46]:
data = pd.merge(aggsMelt,life, on = 'Country Code', how = 'left')

In [47]:
data.head(3)

  Country Name_x Country Code  ... Year_y   Life_exp
0          Aruba          ABW  ...   1960  65.569366
1          Aruba          ABW  ...   1961  65.988024
2          Aruba          ABW  ...   1962  66.365537

[3 rows x 11 columns]

In [48]:
#Filtering by value

data.loc[data.Year_x == '1960'].head(3)

  Country Name_x Country Code  ... Year_y   Life_exp
0          Aruba          ABW  ...   1960  65.569366
1          Aruba          ABW  ...   1961  65.988024
2          Aruba          ABW  ...   1962  66.365537

[3 rows x 11 columns]

In [49]:
data.rename(columns = {'Country Name_x':'Country_Name_x',
                       'Country Code':'Country_Code',
                       'Indicator Name_x':'Indicator_Name_x'


}, inplace = True)

In [50]:
data.loc[data.Country_Code == 'ABW'].head(3)

  Country_Name_x Country_Code  ... Year_y   Life_exp
0          Aruba          ABW  ...   1960  65.569366
1          Aruba          ABW  ...   1961  65.988024
2          Aruba          ABW  ...   1962  66.365537

[3 rows x 11 columns]

In [51]:
data['Country_Code'].tail()

626935    ZWE
626936    ZWE
626937    ZWE
626938    ZWE
626939    ZWE
Name: Country_Code, dtype: object

In [52]:

#filtering by multiple criteria
data.loc[data.Country_Code.isin(['ABW','ZWE'])].sample(5)

       Country_Name_x Country_Code  ... Year_y   Life_exp
603686       Zimbabwe          ZWE  ...   1980  59.377610
301841       Zimbabwe          ZWE  ...   1995  51.341024
81219        Zimbabwe          ZWE  ...   1963  52.629317
499235          Aruba          ABW  ...   1965  67.369756
301900          Aruba          ABW  ...   2000  73.720610

[5 rows x 11 columns]

In [53]:
data.tail()

       Country_Name_x Country_Code  ... Year_y   Life_exp
626935       Zimbabwe          ZWE  ...   2009  51.147927
626936       Zimbabwe          ZWE  ...   2010  53.593122
626937       Zimbabwe          ZWE  ...   2011  55.946220
626938       Zimbabwe          ZWE  ...   2012  58.045976
626939       Zimbabwe          ZWE  ...   2013  59.773488

[5 rows x 11 columns]

In [54]:
data.query('Country_Code == "ZWE" & Life_exp > 59').head(3)

      Country_Name_x Country_Code  ... Year_y   Life_exp
11576       Zimbabwe          ZWE  ...   1980  59.377610
11577       Zimbabwe          ZWE  ...   1981  59.944951
11578       Zimbabwe          ZWE  ...   1982  60.466171

[3 rows x 11 columns]

In [55]:
data.loc[(data['Year_x'] == '1960') & (data['Life_exp'] < np.mean(data['Life_exp']))].head(3)

    Country_Name_x Country_Code  ... Year_y   Life_exp
108    Afghanistan          AFG  ...   1960  31.580049
109    Afghanistan          AFG  ...   1961  32.095976
110    Afghanistan          AFG  ...   1962  32.611878

[3 rows x 11 columns]

In [56]:
data.loc[(data['Population'] > np.mean(data['Population']))
&
(data['Year_x'] == '1960')]

      Country_Name_x Country_Code  ... Year_y   Life_exp
918       Bangladesh          BGD  ...   1960  47.024561
919       Bangladesh          BGD  ...   1961  47.608902
920       Bangladesh          BGD  ...   1962  48.201561
921       Bangladesh          BGD  ...   1963  48.776317
922       Bangladesh          BGD  ...   1964  49.293049
...              ...          ...  ...    ...        ...
11173        Vietnam          VNM  ...   2009  75.170756
11174        Vietnam          VNM  ...   2010  75.311732
11175        Vietnam          VNM  ...   2011  75.457902
11176        Vietnam          VNM  ...   2012  75.606683
11177        Vietnam          VNM  ...   2013  75.756488

[1296 rows x 11 columns]

In [ ]:
data[data['test'] == 1]

In [59]:
data.drop(columns = 'test', inplace = True)

In [ ]:
data.head()

In [ ]:
data.info()

In [ ]:
data.loc[data.Country_Code.isin(['ABW','AFG'])]

In [ ]:
data.loc[data.Year_x.isin(['1960','2013']) & data.Country_Code.isin(['ABW','AFG'])]

In [64]:
#data.loc[data.Year_x == '1960'] = '500'

In [ ]:
data.loc[(data.Country_Code == 'ABW') & (data.Year_y == '1960')]

In [95]:
data[data['Indicator_Name_x'].str.contains('total')]

       Country_Name_x Country_Code  ... Year_y   Life_exp
0               Aruba          ABW  ...   1960  65.569366
1               Aruba          ABW  ...   1961  65.988024
2               Aruba          ABW  ...   1962  66.365537
3               Aruba          ABW  ...   1963  66.713976
4               Aruba          ABW  ...   1964  67.044293
...               ...          ...  ...    ...        ...
626935       Zimbabwe          ZWE  ...   2009  51.147927
626936       Zimbabwe          ZWE  ...   2010  53.593122
626937       Zimbabwe          ZWE  ...   2011  55.946220
626938       Zimbabwe          ZWE  ...   2012  58.045976
626939       Zimbabwe          ZWE  ...   2013  59.773488

[626940 rows x 11 columns]

In [78]:
data['Indicator Code_y'].unique()

array(['SP.DYN.LE00.IN'], dtype=object)

In [ ]:
data['Indicator Code_y'].str.split('.').str[0]

In [102]:
data['test'] = [1 if (x.Year_x == '1960' and x.Country_Name_x == 'Vietnam') else 0 for x in data.itertuples()]

In [ ]:
#wokrs
[1 if (x.Country_Code == 'ABW' and x.Indicator_Name_x[0:3] == 'Abc') else 0 for x in data.itertuples()]

In [103]:
data.columns

Index(['Country_Name_x', 'Country_Code', 'Indicator_Name_x',
       'Indicator Code_x', 'Year_x', 'Population', 'Country Name_y',
       'Indicator Name_y', 'Indicator Code_y', 'Year_y', 'Life_exp', 'test'],
      dtype='object')

In [91]:
data.head(3)

  Country_Name_x Country_Code  ... Year_y   Life_exp
0          Aruba          ABW  ...   1960  65.569366
1          Aruba          ABW  ...   1961  65.988024
2          Aruba          ABW  ...   1962  66.365537

[3 rows x 11 columns]

In [119]:
data.groupby(['Country_Name_x','Country_Code'])['Year_x'].mean()

DataError: ignored

In [121]:
pd.to_numeric(data['Year_x'], inplace = True)

TypeError: ignored